RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_midi.c
/*********************************************************************************************************//**
 * @file    ht32f5xxxx_midi.c
 * @version $Rev:: 6684         $
 * @date    $Date:: 2023-01-18 #$
 * @brief   This file provides all the MIDI firmware functions.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f5xxxx_midi.h"

/** @addtogroup HT32F5xxxx_Peripheral_Driver HT32F5xxxx Peripheral Driver
  * @{
  */

/** @defgroup MIDI MIDI
  * @brief MIDI driver modules
  * @{
  */


/* Private constants ---------------------------------------------------------------------------------------*/
/** @defgroup MIDI_Private_Define MIDI private definitions
  * @{
  */
/* MIDI TRIG ST Mask                                                                                        */
#define TRIG_ST_ENABLE               (u32)0x00000400
#define TRIG_ST_DISABLE              (u32)0xFFFFFBFF

/* MIDI TRIG VM Mask                                                                                        */
#define TRIG_VM_ENABLE               (u32)0x00000200
#define TRIG_VM_DISABLE              (u32)0xFFFFFDFF

/* MIDI TRIG FR Mask                                                                                        */
#define TRIG_FR_ENABLE               (u32)0x00000100
#define TRIG_FR_DISABLE              (u32)0xFFFFFEFF

/* MIDI CHAN CHx Mask                                                                                       */
#define MIDI_CHAN_CHx_MASK           (u32)0x0000001F

/* MIDI FREQ BL Mask                                                                                        */
#define MIDI_FREQ_BL_MASK            (u32)0x0000F000

/* MIDI FREQ FR Mask                                                                                        */
#define MIDI_FREQ_FR_MASK            (u32)0x00000FFF

/* MIDI VOL AR Mask                                                                                         */
#define MIDI_VOL_AR_MASK             (u32)0x80000000

/* MIDI VOL ENV Mask                                                                                        */
#define MIDI_VOL_ENV_MASK            (u32)0x60000000

/* MIDI VOL VL Mask                                                                                         */
#define MIDI_VOL_VL_MASK             (u32)0x03FF0000

/* MIDI VOL VR Mask                                                                                         */
#define MIDI_VOL_VR_MASK             (u32)0x000003FF

/* MIDI RENUM WBS Mask                                                                                      */
#define MIDI_RENUM_WBS_MASK          (u32)0x00030000

/* MIDI RENUM RE Mask                                                                                       */
#define MIDI_RENUM_RE_MASK           (u32)0x00007FFF

/* MIDI MCUCH0 CH0B Mask                                                                                    */
#define MIDI_MCUCH0_CH0B_MASK        (u32)0xFFFF0000

/* MIDI MCUCH0 CH0A Mask                                                                                    */
#define MIDI_MCUCH0_CH0A_MASK        (u32)0x0000FFFF

/* MIDI MCUCH1 CH1B Mask                                                                                    */
#define MIDI_MCUCH1_CH1B_MASK        (u32)0xFFFF0000

/* MIDI MCUCH1 CH1A Mask                                                                                    */
#define MIDI_MCUCH1_CH1A_MASK        (u32)0x0000FFFF

/* MIDI MCUCH2 CH2B Mask                                                                                    */
#define MIDI_MCUCH2_CH2B_MASK        (u32)0xFFFF0000

/* MIDI MCUCH2 CH2A Mask                                                                                    */
#define MIDI_MCUCH2_CH2A_MASK        (u32)0x0000FFFF

/* MIDI MCUCH3 CH3B Mask                                                                                    */
#define MIDI_MCUCH3_CH3B_MASK        (u32)0xFFFF0000

/* MIDI MCUCH3 CH3A Mask                                                                                    */
#define MIDI_MCUCH3_CH3A_MASK        (u32)0x0000FFFF

/* MIDI CTRL MCUCHEN3 Mask                                                                                  */
#define MCUCHEN3_ENABLE              (u32)0x00008000
#define MCUCHEN3_DISABLE             (u32)0xFFFF7FFF

/* MIDI CTRL MCUCHEN2 Mask                                                                                  */
#define MCUCHEN2_ENABLE              (u32)0x00004000
#define MCUCHEN2_DISABLE             (u32)0xFFFFBFFF

/* MIDI CTRL MCUCHEN1 Mask                                                                                  */
#define MCUCHEN1_ENABLE              (u32)0x00002000
#define MCUCHEN1_DISABLE             (u32)0xFFFFDFFF

/* MIDI CTRL MCUCHEN0 Mask                                                                                  */
#define MCUCHEN0_ENABLE              (u32)0x00001000
#define MCUCHEN0_DISABLE             (u32)0xFFFFEFFF

/* MIDI CTRL DACDS Mask                                                                                     */
#define MIDI_CTRL_DACDS_MASK         (u32)0x00000700

/* MIDI CTRL MUSICEN Mask                                                                                   */
#define MUSICEN_ENABLE               (u32)0x00000080
#define MUSICEN_DISABLE              (u32)0xFFFFFF7F

/* MIDI CTRL SPIRDEN Mask                                                                                   */
#define SPIRDEN_ENABLE               (u32)0x00000040
#define SPIRDEN_DISABLE              (u32)0xFFFFFFBF

/* MIDI CTRL SPIDISLOOP Mask                                                                                */
#define SPIDISLOOP_ENABLE            (u32)0x00000020
#define SPIDISLOOP_DISABLE           (u32)0xFFFFFFDF

/* MIDI CTRL CHS Mask                                                                                       */
#define MIDI_CTRL_CHS_MASK           (u32)0x00000007
/**
  * @}
  */

/* Global functions ----------------------------------------------------------------------------------------*/
/** @defgroup MIDI_Exported_Functions MIDI exported functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief Deinitialize the MIDI peripheral registers to their default reset values.
 * @retval None
 ************************************************************************************************************/
void MIDI_DeInit(void)
{
  RSTCU_PeripReset_TypeDef RSTCUReset = {{0}};

  RSTCUReset.Bit.MIDI = 1;
  RSTCU_PeripReset(RSTCUReset, ENABLE);
}

