RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_midi.c
/*********************************************************************************************************//**
  * @brief  Initialize the MIDIx peripheral according to the specified parameters in the MIDI_InitStruct.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  MIDI_InitStruct: pointer to a MIDI_InitTypeDef structure that contains the configuration
  *   information for the specified MIDI peripheral.
  * @retval None
  ***********************************************************************************************************/
void MIDI_Init(HT_MIDI_TypeDef* MIDIx, MIDI_InitTypeDef* MIDI_InitStruct)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_CTRL_DACDS(MIDI_InitStruct->MIDI_CTRL_DACDS));
  Assert_Param(IS_MIDI_CTRL_MUSICEN(MIDI_InitStruct->MIDI_CTRL_MUSICEN));
  Assert_Param(IS_MIDI_CTRL_SPIDISLOOP(MIDI_InitStruct->MIDI_CTRL_SPIDISLOOP));
  Assert_Param(IS_MIDI_CTRL_CHS(MIDI_InitStruct->MIDI_CTRL_CHS));
  Assert_Param(IS_MIDI_FREQ_BL(MIDI_InitStruct->MIDI_FREQ_BL));
  Assert_Param(IS_MIDI_FREQ_FR(MIDI_InitStruct->MIDI_FREQ_FR));
  Assert_Param(IS_MIDI_VOL_AR(MIDI_InitStruct->MIDI_VOL_AR));
  Assert_Param(IS_MIDI_VOL_ENV(MIDI_InitStruct->MIDI_VOL_ENV));
  Assert_Param(IS_MIDI_VOL_VL(MIDI_InitStruct->MIDI_VOL_VL));
  Assert_Param(IS_MIDI_VOL_VR(MIDI_InitStruct->MIDI_VOL_VR));
  Assert_Param(IS_MIDI_STADDR(MIDI_InitStruct->MIDI_STADDR));
  Assert_Param(IS_MIDI_RENUM_WBS(MIDI_InitStruct->MIDI_RENUM_WBS));
  Assert_Param(IS_MIDI_RENUM_RE(MIDI_InitStruct->MIDI_RENUM_RE));
  Assert_Param(IS_MIDI_ENDADDR(MIDI_InitStruct->MIDI_ENDADDR));
  Assert_Param(IS_MIDI_CHAN_ST(MIDI_InitStruct->MIDI_CHAN_ST));
  Assert_Param(IS_MIDI_CHAN_VM(MIDI_InitStruct->MIDI_CHAN_VM));
  Assert_Param(IS_MIDI_CHAN_FR(MIDI_InitStruct->MIDI_CHAN_FR));
  Assert_Param(IS_MIDI_CHAN_CHx(MIDI_InitStruct->MIDI_CHAN_CHx));

  MIDIx->CTRL = ((MIDI_InitStruct->MIDI_CTRL_DACDS) << 8) |
                ((MIDI_InitStruct->MIDI_CTRL_MUSICEN) << 7) |
                ((MIDI_InitStruct->MIDI_CTRL_SPIDISLOOP) << 6) |
                (MIDI_InitStruct->MIDI_CTRL_CHS);

  MIDIx->FREQ = ((MIDI_InitStruct->MIDI_FREQ_BL) << 12) |
                (MIDI_InitStruct->MIDI_FREQ_FR);

  MIDIx->VOL = ((MIDI_InitStruct->MIDI_VOL_AR) << 31) |
               ((MIDI_InitStruct->MIDI_VOL_ENV) << 29) |
               ((MIDI_InitStruct->MIDI_VOL_VL) << 16) |
               (MIDI_InitStruct->MIDI_VOL_VR);

  MIDIx->ST_ADDR = MIDI_InitStruct->MIDI_STADDR;

  MIDIx->RE_NUM = ((MIDI_InitStruct->MIDI_RENUM_WBS) << 16) |
                  (MIDI_InitStruct->MIDI_RENUM_RE);

  MIDIx->END_ADDR = MIDI_InitStruct->MIDI_ENDADDR;

  MIDIx->CHAN = ((MIDI_InitStruct->MIDI_CHAN_ST) << 10) |
                ((MIDI_InitStruct->MIDI_CHAN_VM) << 9) |
                ((MIDI_InitStruct->MIDI_CHAN_FR) << 8) |
                (MIDI_InitStruct->MIDI_CHAN_CHx);
}

/*********************************************************************************************************//**
  * @brief  Fill each MIDI_InitStruct member with its default value.
  * @param  MIDI_InitStruct: pointer to an MIDI_InitTypeDef structure which will be initialized.
  * @retval None
  ***********************************************************************************************************/
void MIDI_StructInit(MIDI_InitTypeDef* MIDI_InitStruct)
{
  /* Initialize the MIDI_CTRL_DACDS member                                                                  */
  MIDI_InitStruct->MIDI_CTRL_DACDS = 0x0;

  /* Initialize the MIDI_CTRL_MUSICEN member                                                                */
  MIDI_InitStruct->MIDI_CTRL_MUSICEN = DISABLE;

  /* Initialize the MIDI_CTRL_SPIDISLOOP member                                                             */
  MIDI_InitStruct->MIDI_CTRL_SPIDISLOOP = DISABLE;

  /* Initialize the MIDI_CTRL_CHS member                                                                    */
  MIDI_InitStruct->MIDI_CTRL_CHS = CHS16;

  /* Initialize the MIDI_FREQ_BL member                                                                     */
  MIDI_InitStruct->MIDI_FREQ_BL = BL0;

  /* Initialize the MIDI_FREQ_FR member                                                                     */
  MIDI_InitStruct->MIDI_FREQ_FR = 0x0;

  /* Initialize the MIDI_VOL_AR member                                                                      */
  MIDI_InitStruct->MIDI_VOL_AR = ENV_RELEASE;

  /* Initialize the MIDI_VOL_ENV member                                                                     */
  MIDI_InitStruct->MIDI_VOL_ENV = ENV_NO;

  /* Initialize the MIDI_VOL_VL member                                                                      */
  MIDI_InitStruct->MIDI_VOL_VL = 0x3FF;

  /* Initialize the MIDI_VOL_VR member                                                                      */
  MIDI_InitStruct->MIDI_VOL_VR = 0x3FF;

  /* Initialize the MIDI_STADDR member                                                                      */
  MIDI_InitStruct->MIDI_STADDR = 0x0;

  /* Initialize the MIDI_RENUM_WBS member                                                                   */
  MIDI_InitStruct->MIDI_RENUM_WBS = WBS8;

  /* Initialize the MIDI_RENUM_RE member                                                                    */
  MIDI_InitStruct->MIDI_RENUM_RE = 0x0;

  /* Initialize the MIDI_ENDADDR member                                                                     */
  MIDI_InitStruct->MIDI_ENDADDR = 0x0;

  /* Initialize the MIDI_CHAN_ST member                                                                     */
  MIDI_InitStruct->MIDI_CHAN_ST = DISABLE;

  /* Initialize the MIDI_CHAN_VM member                                                                     */
  MIDI_InitStruct->MIDI_CHAN_VM = DISABLE;

  /* Initialize the MIDI_CHAN_FR member                                                                     */
  MIDI_InitStruct->MIDI_CHAN_FR = DISABLE;

  /* Initialize the MIDI_CHAN_CHx member                                                                    */
  MIDI_InitStruct->MIDI_CHAN_CHx = MIDI_CHx0;
}

