RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_midi.c
/*********************************************************************************************************//**
  * @brief  Enable or Disable the specified MIDI interrupt.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  MIDI_Int: specify if the MIDI interrupt source to be enabled or disabled.
  *   This parameter can be any combination of the following values:
  *     @arg MIDIO_DMAEN             : MIDIO DMAEN
  *     @arg MIDII_DMAEN             : MIDII DMAEN
  *     @arg MIDI_INTEN              : MIDI INTEN
  * @param  NewState: new state of the MIDI interrupts.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  ***********************************************************************************************************/
void MIDI_IntConfig(HT_MIDI_TypeDef* MIDIx, u32 MIDI_Int, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_INT(MIDI_Int));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    MIDIx->IER |= MIDI_Int;
  }
  else
  {
    MIDIx->IER &= (u32)~MIDI_Int;
  }
}

/*********************************************************************************************************//**
  * @brief  Check whether the specified MIDI flag has been set or not.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  MIDI_Flag: specify the flag that is to be check.
  *   This parameter can be one of the following values:
  *     @arg MIDI_INTF             : MIDI int flag
  * @retval The new state of MIDI_Flag (SET or RESET).
  ***********************************************************************************************************/
FlagStatus MIDI_GetFlagStatus(HT_MIDI_TypeDef* MIDIx, u32 MIDI_Flag)
{
  FlagStatus bitstatus = RESET;
  u32 statusreg = 0;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_FLAG(MIDI_Flag));

  statusreg = MIDIx->SR;

  if ((statusreg & MIDI_Flag) != (u32)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

  return bitstatus;
}

/*********************************************************************************************************//**
  * @brief  Clear the specified MIDI flag.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  MIDI_Flag: specify the flag that is to be cleared.
  *   This parameter can be one of the following values:
  *     @arg MIDI_INTF            : MIDI INTF
  * @retval None
  ***********************************************************************************************************/
void MIDI_ClearFlag(HT_MIDI_TypeDef* MIDIx, u32 MIDI_Flag)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_FLAG_CLEAR(MIDI_Flag));

  MIDIx->SR = MIDI_Flag;
}

/*********************************************************************************************************//**
  * @brief  Configure the Channel for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  MCUCHEN3: this parameter can be ENABLE or DISABLE.
  * @param  MCUCHEN2: this parameter can be ENABLE or DISABLE.
  * @param  MCUCHEN1: this parameter can be ENABLE or DISABLE.
  * @param  MCUCHEN0: this parameter can be ENABLE or DISABLE.
  * @param  DACDS: specify the clipping and distorting volume of the MIDI.
  * @param  MUSICEN: this parameter can be ENABLE or DISABLE.
  * @param  SPIRDEN: this parameter can be ENABLE or DISABLE.
  * @param  SPIDISLOOP: this parameter can be ENABLE or DISABLE.
  * @param  CHS: specify channel selection of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_CTRL(HT_MIDI_TypeDef* MIDIx,
               MIDI_CTRL_MCUCHEN3_Enum MCUCHEN3, MIDI_CTRL_MCUCHEN2_Enum MCUCHEN2,
               MIDI_CTRL_MCUCHEN1_Enum MCUCHEN1, MIDI_CTRL_MCUCHEN0_Enum MCUCHEN0,
               u8 DACDS,
               MIDI_CTRL_MUSICEN_Enum MUSICEN,
               MIDI_CTRL_SPIRDEN_Enum SPIRDEN, MIDI_CTRL_SPIDISLOOP_Enum SPIDISLOOP,
               MIDI_CTRL_CHS_Enum CHS)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_CTRL_MCUCHEN3(MCUCHEN3));
  Assert_Param(IS_MIDI_CTRL_MCUCHEN2(MCUCHEN2));
  Assert_Param(IS_MIDI_CTRL_MCUCHEN1(MCUCHEN1));
  Assert_Param(IS_MIDI_CTRL_MCUCHEN0(MCUCHEN0));
  Assert_Param(IS_MIDI_CTRL_DACDS(DACDS));
  Assert_Param(IS_MIDI_CTRL_MUSICEN(MUSICEN));
  Assert_Param(IS_MIDI_CTRL_SPIRDEN(SPIRDEN));
  Assert_Param(IS_MIDI_CTRL_SPIDISLOOP(SPIDISLOOP));
  Assert_Param(IS_MIDI_CTRL_CHS(CHS));

  MIDIx->CTRL = (MCUCHEN3 << 15) | (MCUCHEN2 << 14) | (MCUCHEN1 << 13) | (MCUCHEN0 << 12) |
                (DACDS << 8) |
                (MUSICEN << 7) |
                (SPIRDEN << 6) | (SPIDISLOOP << 5) |
                 CHS;
}

/*********************************************************************************************************//**
  * @brief  Configure the FREQ for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  BL: specify octave of the MIDI.
  * @param  FR: specify pitch of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_FREQ(HT_MIDI_TypeDef* MIDIx, MIDI_FREQ_BL_Enum BL, u16 FR)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_FREQ_BL(BL));
  Assert_Param(IS_MIDI_FREQ_FR(FR));

  MIDIx->FREQ = (BL << 12) | FR;
}

