RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_midi.c
/*********************************************************************************************************//**
  * @brief  Configure the VOL for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  A_R: specify attack or release of the MIDI.
  * @param  ENV: specify envelope of the MIDI.
  * @param  VL: specify left channel of the MIDI.
  * @param  VR: specify right channel of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_VOL(HT_MIDI_TypeDef* MIDIx, MIDI_VOL_AR_Enum A_R, MIDI_VOL_ENV_Enum ENV, u16 VL, u16 VR)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_VOL_AR(A_R));
  Assert_Param(IS_MIDI_VOL_ENV(ENV));
  Assert_Param(IS_MIDI_VOL_VL(VL));
  Assert_Param(IS_MIDI_VOL_VR(VR));

  MIDIx->VOL = (A_R << 31) | (ENV << 29) | (VL << 16) | VR;
}

/*********************************************************************************************************//**
  * @brief  Configure the Start Address for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  ST_ADDR: specify start address of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_STADDR(HT_MIDI_TypeDef* MIDIx, u32 ST_ADDR)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_STADDR(ST_ADDR));

  MIDIx->ST_ADDR = ST_ADDR;
}

/*********************************************************************************************************//**
  * @brief  Configure the RENUM for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  WBS: specify waveform of the MIDI.
  * @param  RE: specify repeated code of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_RENUM(HT_MIDI_TypeDef* MIDIx, MIDI_RENUM_WBS_Enum WBS, u16 RE)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_RENUM_WBS(WBS));
  Assert_Param(IS_MIDI_RENUM_RE(RE));

  MIDIx->RE_NUM = (WBS << 16) | RE;
}

/*********************************************************************************************************//**
  * @brief  Configure the End Address for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  END_ADDR: specify end address of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_ENDADDR(HT_MIDI_TypeDef* MIDIx, u32 END_ADDR)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_ENDADDR(END_ADDR));

  MIDIx->END_ADDR = END_ADDR;
}

/*********************************************************************************************************//**
  * @brief  Configure the Channel for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  TRIG_ST: this parameter can be ENABLE or DISABLE.
  * @param  TRIG_VM: this parameter can be ENABLE or DISABLE.
  * @param  TRIG_FR: this parameter can be ENABLE or DISABLE.
  * @param  CHx: specify selected channel of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_CHAN(HT_MIDI_TypeDef* MIDIx,
               MIDI_CHAN_ST_Enum TRIG_ST, MIDI_CHAN_VM_Enum TRIG_VM, MIDI_CHAN_FR_Enum TRIG_FR,
               u8 CHx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_CHAN_ST(TRIG_ST));
  Assert_Param(IS_MIDI_CHAN_VM(TRIG_VM));
  Assert_Param(IS_MIDI_CHAN_FR(TRIG_FR));
  Assert_Param(IS_MIDI_CHAN_CHx(CHx));

  MIDIx->CHAN = (TRIG_ST << 10) | (TRIG_VM << 9) | (TRIG_FR << 8) | CHx;
}

/*********************************************************************************************************//**
  * @brief  Configure the MCU CH0 DATA for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  CH0B: specify DATA[31:16] of MCU CH0 of the MIDI.
  * @param  CH0A: specify DATA[15:0] of MCU CH0 of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_MCUCH0(HT_MIDI_TypeDef* MIDIx, u16 CH0B, u16 CH0A)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_MCUCHx11_BH(CH0B));
  Assert_Param(IS_MIDI_MCUCHx11_BL(CH0A));

  MIDIx->MCU_CH0 = (CH0B << 16) | CH0A;
}

/*********************************************************************************************************//**
  * @brief  Configure the MCU CH1 DATA for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  CH1B: specify DATA[31:16] of MCU CH1 of the MIDI.
  * @param  CH1A: specify DATA[15:0] of MCU CH1 of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_MCUCH1(HT_MIDI_TypeDef* MIDIx, u16 CH1B, u16 CH1A)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_MCUCHx12_CH(CH1B));
  Assert_Param(IS_MIDI_MCUCHx12_CL(CH1A));

