RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_midi.c
  MIDIx->MCU_CH1 = (CH1B << 16) | CH1A;
}

/*********************************************************************************************************//**
  * @brief  Configure the MCU CH2 DATA for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  CH2B: specify DATA[31:16] of MCU CH2 of the MIDI.
  * @param  CH2A: specify DATA[15:0] of MCU CH2 of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_MCUCH2(HT_MIDI_TypeDef* MIDIx, u16 CH2B, u16 CH2A)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_MCUCHx13_DH(CH2B));
  Assert_Param(IS_MIDI_MCUCHx13_DL(CH2A));

  MIDIx->MCU_CH2 = (CH2B << 16) | CH2A;
}

/*********************************************************************************************************//**
  * @brief  Configure the MCU CH3 DATA for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  CH3B: specify DATA[31:16] of MCU CH3 of the MIDI.
  * @param  CH3A: specify DATA[15:0] of MCU CH3 of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_MCUCH3(HT_MIDI_TypeDef* MIDIx, u16 CH3B, u16 CH3A)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_MCUCHx14_EH(CH3B));
  Assert_Param(IS_MIDI_MCUCHx14_EL(CH3A));

  MIDIx->MCU_CH3 = (CH3B << 16) | CH3A;
}

/*********************************************************************************************************//**
  * @brief  Configure the FREQ BL for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  BL: specify octave of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_FREQ_BL(HT_MIDI_TypeDef* MIDIx, MIDI_FREQ_BL_Enum BL)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_FREQ_BL(BL));

  /* Clear BL[3:0] in FREQ                                                                                  */
  MIDIx->FREQ &= (u32)~MIDI_FREQ_BL_MASK;

  /* Set new BL[3:0] in FREQ                                                                                */
  MIDIx->FREQ |= (BL << 12);
}

/*********************************************************************************************************//**
  * @brief  Configure the FREQ FR for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  FR: specify pitch of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_FREQ_FR(HT_MIDI_TypeDef* MIDIx, u16 FR)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_FREQ_FR(FR));

  /* Clear FR[11:0] in FREQ                                                                                 */
  MIDIx->FREQ &= (u32)~MIDI_FREQ_FR_MASK;

  /* Set new FR[11:0] in FREQ                                                                               */
  MIDIx->FREQ |= FR;
}

/*********************************************************************************************************//**
  * @brief  Configure the VOL AR for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  A_R: specify attack or release of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_VOL_AR(HT_MIDI_TypeDef* MIDIx, MIDI_VOL_AR_Enum A_R)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_VOL_AR(A_R));

  /* Clear A_R in VOL                                                                                       */
  MIDIx->VOL &= (u32)~MIDI_VOL_AR_MASK;

  /* Set new A_R in VOL                                                                                     */
  MIDIx->VOL |= (A_R << 31);
}

/*********************************************************************************************************//**
  * @brief  Configure the VOL ENV for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  ENV: specify envelope of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_VOL_ENV(HT_MIDI_TypeDef* MIDIx, MIDI_VOL_ENV_Enum ENV)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_VOL_ENV(ENV));

  /* Clear ENV[1:0] in VOL                                                                                  */
  MIDIx->VOL &= (u32)~MIDI_VOL_ENV_MASK;

  /* Set new ENV[1:0] in VOL                                                                                */
  MIDIx->VOL |= (ENV << 29);
}

/*********************************************************************************************************//**
  * @brief  Configure the VOL VL for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  VL: specify left channel of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_VOL_VL(HT_MIDI_TypeDef* MIDIx, u16 VL)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_VOL_VL(VL));

  /* Clear VL[9:0] in VOL                                                                                   */
  MIDIx->VOL &= (u32)~MIDI_VOL_VL_MASK;

  /* Set new VL[9:0] in VOL                                                                                 */
  MIDIx->VOL |= (VL << 16);
}

