RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_midi.c
/*********************************************************************************************************//**
  * @brief  Configure the VOL VR for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  VR: specify right channel of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_VOL_VR(HT_MIDI_TypeDef* MIDIx, u16 VR)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_VOL_VR(VR));

  /* Clear VR[9:0] in VOL                                                                                   */
  MIDIx->VOL &= (u32)~MIDI_VOL_VR_MASK;

  /* Set new VR[9:0] in VOL                                                                                 */
  MIDIx->VOL |= VR;
}

/*********************************************************************************************************//**
  * @brief  Configure the RENUM WBS for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  WBS: specify waveform of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_RENUM_WBS(HT_MIDI_TypeDef* MIDIx, MIDI_RENUM_WBS_Enum WBS)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_RENUM_WBS(WBS));

  /* Clear WBS[1:0] in RENUM                                                                                */
  MIDIx->RE_NUM &= (u32)~MIDI_RENUM_WBS_MASK;

  /* Set new WBS[1:0] in RENUM                                                                              */
  MIDIx->RE_NUM |= (WBS << 16);
}

/*********************************************************************************************************//**
  * @brief  Configure the RENUM RE for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  RE: specify repeated code of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_RENUM_RE(HT_MIDI_TypeDef* MIDIx, u16 RE)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_RENUM_RE(RE));

  /* Clear RE[14:0] in RENUM                                                                                */
  MIDIx->RE_NUM &= (u32)~MIDI_RENUM_RE_MASK;

  /* Set new RE[14:0] in RENUM                                                                              */
  MIDIx->RE_NUM |= RE;
}

/*********************************************************************************************************//**
  * @brief  Enable or Disable ST ADDR for the specified MIDI peripheral.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  NewState: new state of the MIDIx peripheral.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  ***********************************************************************************************************/
void MIDI_CHAN_STCmd(HT_MIDI_TypeDef* MIDIx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    MIDIx->CHAN |= TRIG_ST_ENABLE;
  }
  else
  {
    MIDIx->CHAN &= (TRIG_ST_DISABLE);
  }
}

/*********************************************************************************************************//**
  * @brief  Enable or Disable VM for the specified MIDI peripheral.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  NewState: new state of the MIDIx peripheral.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  ***********************************************************************************************************/
void MIDI_CHAN_VMCmd(HT_MIDI_TypeDef* MIDIx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    MIDIx->CHAN |= TRIG_VM_ENABLE;
  }
  else
  {
    MIDIx->CHAN &= (TRIG_VM_DISABLE);
  }
}

/*********************************************************************************************************//**
  * @brief  Enable or Disable FR for the specified MIDI peripheral.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  NewState: new state of the MIDIx peripheral.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  ***********************************************************************************************************/
void MIDI_CHAN_FRCmd(HT_MIDI_TypeDef* MIDIx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    MIDIx->CHAN |= TRIG_FR_ENABLE;
  }
  else
  {
    MIDIx->CHAN &= (TRIG_FR_DISABLE);
  }
}

/*********************************************************************************************************//**
  * @brief  Configure the Selected Channel for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  CHx: specify selected channel of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_CHAN_CHx(HT_MIDI_TypeDef* MIDIx, u8 CHx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_CHAN_CHx(CHx));

