RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_midi.c
  /* Clear CHx[4:0] in CHAN                                                                                 */
  MIDIx->CHAN &= (u32)~MIDI_CHAN_CHx_MASK;

  /* Set new CHx[4:0] in CHAN                                                                               */
  MIDIx->CHAN |= CHx;
}

/*********************************************************************************************************//**
  * @brief  Configure the CH0B of MCU CH0 DATA for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  CH0B: specify DATA[31:16] of MCU CH0 of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_MCUCH0_CH0B(HT_MIDI_TypeDef* MIDIx, u16 CH0B)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_MCUCHx11_BH(CH0B));

  /* Clear CH0B[16:0] in MCUCH0                                                                             */
  MIDIx->MCU_CH0 &= (u32)~MIDI_MCUCH0_CH0B_MASK;

  /* Set new CH0B[16:0] in MCUCH0                                                                           */
  MIDIx->MCU_CH0 |= (CH0B << 16);
}

/*********************************************************************************************************//**
  * @brief  Configure the CH0A of MCU CH0 DATA for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  CH0A: specify DATA[15:0] of MCU CH0 of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_MCUCH0_CH0A(HT_MIDI_TypeDef* MIDIx, u16 CH0A)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_MCUCHx11_BL(CH0A));

  /* Clear CH0B[16:0] in MCUCH0                                                                             */
  MIDIx->MCU_CH0 &= (u32)~MIDI_MCUCH0_CH0A_MASK;

  /* Set new CH0B[16:0] in MCUCH0                                                                           */
  MIDIx->MCU_CH0 |= CH0A;
}

/*********************************************************************************************************//**
  * @brief  Configure the CH1B of MCU CH1 DATA for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  CH1B: specify DATA[31:16] of MCU CH1 of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_MCUCH1_CH1B(HT_MIDI_TypeDef* MIDIx, u16 CH1B)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_MCUCHx12_CH(CH1B));

  /* Clear CH0B[16:0] in MCUCH0                                                                             */
  MIDIx->MCU_CH1 &= (u32)~MIDI_MCUCH1_CH1B_MASK;

  /* Set new CH1B[16:0] in MCUCH1                                                                           */
  MIDIx->MCU_CH1 |= (CH1B << 16);
}

/*********************************************************************************************************//**
  * @brief  Configure the CH1A of MCU CH1 DATA for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  CH1A: specify DATA[15:0] of MCU CH1 of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_MCUCH1_CH1A(HT_MIDI_TypeDef* MIDIx, u16 CH1A)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_MCUCHx12_CL(CH1A));

  /* Clear CH1A[16:0] in MCUCH1                                                                             */
  MIDIx->MCU_CH1 &= (u32)~MIDI_MCUCH1_CH1A_MASK;

  /* Set new CH1A[16:0] in MCUCH1                                                                           */
  MIDIx->MCU_CH1 |= CH1A;
}

/*********************************************************************************************************//**
  * @brief  Configure the CH2B of MCU CH2 DATA for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  CH2B: specify DATA[31:16] of MCU CH2 of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_MCUCH2_CH2B(HT_MIDI_TypeDef* MIDIx, u16 CH2B)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_MCUCHx13_DH(CH2B));

  /* Clear CH2B[16:0] in MCUCH2                                                                             */
  MIDIx->MCU_CH2 &= (u32)~MIDI_MCUCH2_CH2B_MASK;

  /* Set new CH2B[16:0] in MCUCH2                                                                           */
  MIDIx->MCU_CH2 |= (CH2B << 16);
}

/*********************************************************************************************************//**
  * @brief  Configure the CH2A of MCU CH2 DATA for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  CH2A: specify DATA[15:0] of MCU CH2 of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_MCUCH2_CH2A(HT_MIDI_TypeDef* MIDIx, u16 CH2A)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_MCUCHx13_DL(CH2A));

  /* Clear CH2A[16:0] in MCUCH2                                                                             */
  MIDIx->MCU_CH2 &= (u32)~MIDI_MCUCH2_CH2A_MASK;

