RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_midi.c
  /* Set new CH2A[16:0] in MCUCH2                                                                           */
  MIDIx->MCU_CH2 |= CH2A;
}

/*********************************************************************************************************//**
  * @brief  Configure the CH3B of MCU CH3 DATA for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  CH3B: specify DATA[31:16] of MCU CH3 of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_MCUCH3_CH3B(HT_MIDI_TypeDef* MIDIx, u16 CH3B)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_MCUCHx14_EH(CH3B));

  /* Clear CH3B[16:0] in MCUCH3                                                                             */
  MIDIx->MCU_CH3 &= (u32)~MIDI_MCUCH3_CH3B_MASK;

  /* Set new CH3B[16:0] in MCUCH3                                                                           */
  MIDIx->MCU_CH3 |= (CH3B << 16);
}

/*********************************************************************************************************//**
  * @brief  Configure the CH3A of MCU CH3 DATA for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  CH3A: specify DATA[15:0] of MCU CH3 of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_MCUCH3_CH3A(HT_MIDI_TypeDef* MIDIx, u16 CH3A)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_MCUCHx14_EL(CH3A));

  /* Clear CH3A[16:0] in MCUCH3                                                                             */
  MIDIx->MCU_CH3 &= (u32)~MIDI_MCUCH3_CH3A_MASK;

  /* Set new CH3A[16:0] in MCUCH3                                                                           */
  MIDIx->MCU_CH3 |= CH3A;
}

/*********************************************************************************************************//**
  * @brief  Enable or Disable MCU CHEN3 for the specified MIDI peripheral.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  NewState: new state of the MIDIx peripheral.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  ***********************************************************************************************************/
void MIDI_CTRL_MCUCHEN3(HT_MIDI_TypeDef* MIDIx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    MIDIx->CTRL |= MCUCHEN3_ENABLE;
  }
  else
  {
    MIDIx->CTRL &= MCUCHEN3_DISABLE;
  }
}

/*********************************************************************************************************//**
  * @brief  Enable or Disable MCU CHEN2 for the specified MIDI peripheral.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  NewState: new state of the MIDIx peripheral.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  ***********************************************************************************************************/
void MIDI_CTRL_MCUCHEN2(HT_MIDI_TypeDef* MIDIx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    MIDIx->CTRL |= MCUCHEN2_ENABLE;
  }
  else
  {
    MIDIx->CTRL &= MCUCHEN2_DISABLE;
  }
}

/*********************************************************************************************************//**
  * @brief  Enable or Disable MCU CHEN1 for the specified MIDI peripheral.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  NewState: new state of the MIDIx peripheral.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  ***********************************************************************************************************/
void MIDI_CTRL_MCUCHEN1(HT_MIDI_TypeDef* MIDIx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    MIDIx->CTRL |= MCUCHEN1_ENABLE;
  }
  else
  {
    MIDIx->CTRL &= MCUCHEN1_DISABLE;
  }
}

/*********************************************************************************************************//**
  * @brief  Enable or Disable MCU CHEN0 for the specified MIDI peripheral.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  NewState: new state of the MIDIx peripheral.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  ***********************************************************************************************************/
void MIDI_CTRL_MCUCHEN0(HT_MIDI_TypeDef* MIDIx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    MIDIx->CTRL |= MCUCHEN0_ENABLE;
  }
  else
  {
    MIDIx->CTRL &= MCUCHEN0_DISABLE;
  }
}


/*********************************************************************************************************//**
  * @brief  Configure the DACDS for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  DACDS: specify the clipping and distorting volume of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_CTRL_DACDS(HT_MIDI_TypeDef* MIDIx, u8 DACDS)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_CTRL_DACDS(DACDS));

  /* Clear DACDS[2:0] in CTRL                                                                               */
  MIDIx->CTRL &= (u32)~MIDI_CTRL_DACDS_MASK;

