RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_midi.c
  /* Set new DACDS[2:0] in CTRL                                                                             */
  MIDIx->CTRL |= (DACDS << 8);
}

/*********************************************************************************************************//**
  * @brief  Enable or Disable MUSIC Engine for the specified MIDI peripheral.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  NewState: new state of the MIDIx peripheral.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  ***********************************************************************************************************/
void MIDI_CTRL_MUSICENCmd(HT_MIDI_TypeDef* MIDIx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    MIDIx->CTRL |= MUSICEN_ENABLE;
  }
  else
  {
    MIDIx->CTRL &= MUSICEN_DISABLE;
  }
}

/*********************************************************************************************************//**
  * @brief  Enable or Disable SPI RDEN for the specified MIDI peripheral.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  NewState: new state of the MIDIx peripheral.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  ***********************************************************************************************************/
void MIDI_CTRL_SPIRDENCmd(HT_MIDI_TypeDef* MIDIx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    MIDIx->CTRL |= SPIRDEN_ENABLE;
  }
  else
  {
    MIDIx->CTRL &= SPIRDEN_DISABLE;
  }
}

/*********************************************************************************************************//**
  * @brief  Enable or Disable SPI DISLOOP for the specified MIDI peripheral.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  NewState: new state of the MIDIx peripheral.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  ***********************************************************************************************************/
void MIDI_CTRL_SPIDISLOOPCmd(HT_MIDI_TypeDef* MIDIx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    MIDIx->CTRL |= SPIDISLOOP_ENABLE;
  }
  else
  {
    MIDIx->CTRL &= SPIDISLOOP_DISABLE;
  }
}

/*********************************************************************************************************//**
  * @brief  Configure the Channel Selection for the selected MIDI.
  * @param  MIDIx: where MIDIx is the selected MIDI from the MIDI peripherals.
  * @param  CHS: specify channel selection of the MIDI.
  * @retval None
  ***********************************************************************************************************/
void MIDI_CTRL_CHS(HT_MIDI_TypeDef* MIDIx, u8 CHS)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_MIDI(MIDIx));
  Assert_Param(IS_MIDI_CTRL_CHS(CHS));

  /* Clear CHS[2:0] in CTRL                                                                                 */
  MIDIx->CTRL &= (u32)~MIDI_CTRL_CHS_MASK;

  /* Set new CHS[2:0] in CTRL                                                                               */
  MIDIx->CTRL |= CHS;
}

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
